This file is an attempt to generate random names to make a random sci-fi name generator.

The first step is to find an enormous list of names, such as census name data.

In [1]:
import pandas as pd
import numpy as np
import os

In [13]:
import os

def get_dir_files(dir):
    all_files=os.listdir(dir)
    txt.files = []
    for file in all_files:
        full_path = os.path.join(dir, file)
        if file.find(".txt") != -1:
            txt_files.append(full_path)
        else:
            pass
    return txt_files

def get_united_file(all_files):
    with open(fr"united.txt", "w") as outfile:
        for file in all_files:
            with open(file) as infile:
                outfile.write(infile.read() + "\n")
                
def main():
    dir_path = fr"\random_scifi_generator\names"
    all_files = get_dir_files(dir_path)
    get_united_file(all_files)

In [14]:
import pandas as pd
read_file = pd.read_csv("united.txt")
read_file.to_csv("united.csv", index=False)

In [26]:
all_names = pd.read_csv("united.csv")
all_names.sort_values("gender")
all_names.head()

        name gender  number
0       Mary      F    7065
1       Anna      F    2604
2       Emma      F    2003
3  Elizabeth      F    1939
4     Minnie      F    1746

In [27]:
all_names.tail()

            name gender  number
2085153   Zuberi      M       5
2085154     Zydn      M       5
2085155    Zylon      M       5
2085156   Zymeer      M       5
2085157  Zymeire      M       5

In [85]:
all_names.shape

(2085158, 3)

Let's get rid of the duplicates.

In [37]:
sorted_names = all_names.drop_duplicates()
sorted_names.head()

        name gender  number
0       Mary      F    7065
1       Anna      F    2604
2       Emma      F    2003
3  Elizabeth      F    1939
4     Minnie      F    1746

In [38]:
sorted_names.isna

<bound method DataFrame.isna of               name gender  number
0             Mary      F    7065
1             Anna      F    2604
2             Emma      F    2003
3        Elizabeth      F    1939
4           Minnie      F    1746
...            ...    ...     ...
2085148       Zoah      M       5
2085151    Zoraver      M       5
2085152    Zoumana      M       5
2085154       Zydn      M       5
2085157    Zymeire      M       5

[1126549 rows x 3 columns]>

Now we have to split this giant database of names into female and male.

In [39]:
female_names = sorted_names[sorted_names["gender"] == "F"]
female_names.head()

        name gender  number
0       Mary      F    7065
1       Anna      F    2604
2       Emma      F    2003
3  Elizabeth      F    1939
4     Minnie      F    1746

In [40]:
female_names.drop("gender", axis=1, inplace=True)
female_names.drop("number", axis=1, inplace=True)
female_names.head()

C:\Users\LauraKhadas\AppData\Local\Temp\ipykernel_24520\212308977.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  female_names.drop("gender", axis=1, inplace=True)
C:\Users\LauraKhadas\AppData\Local\Temp\ipykernel_24520\212308977.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  female_names.drop("number", axis=1, inplace=True)

        name
0       Mary
1       Anna
2       Emma
3  Elizabeth
4     Minnie

Let's put these in capital letters.

In [41]:
female_names = female_names.apply(lambda x: x.astype(str).str.upper())
female_names.head()

        name
0       MARY
1       ANNA
2       EMMA
3  ELIZABETH
4     MINNIE

In [42]:
female_names.isna

<bound method DataFrame.isna of               name
0             MARY
1             ANNA
2             EMMA
3        ELIZABETH
4           MINNIE
...            ...
2070891    ZUHAIRA
2070893   ZULAIKHA
2070898     ZYLANI
2070899    ZYLAYAH
2070901     ZYMANI

[677382 rows x 1 columns]>

Now let's get the male names.

In [43]:
male_names = sorted_names[sorted_names["gender"] == "M"]
male_names.head()

        name gender  number
942     John      M    9655
943  William      M    9532
944    James      M    5927
945  Charles      M    5348
946   George      M    5126

Now let's drop the number and gender columns, leaving a list of names.

In [44]:
male_names.drop("gender", axis=1, inplace=True)
male_names.drop("number", axis=1, inplace=True)
male_names.head()

C:\Users\LauraKhadas\AppData\Local\Temp\ipykernel_24520\2953715483.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  male_names.drop("gender", axis=1, inplace=True)
C:\Users\LauraKhadas\AppData\Local\Temp\ipykernel_24520\2953715483.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  male_names.drop("number", axis=1, inplace=True)

        name
942     John
943  William
944    James
945  Charles
946   George

Let's put these in capital letters.

In [46]:
male_names = male_names.apply(lambda x: x.astype(str).str.upper())
male_names.head()

        name
942     JOHN
943  WILLIAM
944    JAMES
945  CHARLES
946   GEORGE

Okay, now I have a list of thousands of first names.

But first, let's look at my surnames database and clean it up.

In [52]:
df_surnames = pd.read_csv("_surnames_USA_2010_database.csv")
df_surnames.head()

  lastnames
0     SMITH
1   JOHNSON
2  WILLIAMS
3     JONES
4     BROWN

In [53]:
df_surnames.sort_values(by=["lastnames"], inplace=True)
df_surnames.head()

      lastnames
1456      AARON
16270    AARONS
18371     AASEN
9370       ABAD
15943    ABADIE

In [54]:
sorted_surnames = df_surnames.drop_duplicates()
sorted_surnames.head()

      lastnames
1456      AARON
16270    AARONS
18371     AASEN
9370       ABAD
15943    ABADIE

Now we have a list of surnames.

In [87]:
sorted_surnames.shape

(18838, 1)

Now let's look at cool_names.csv, which is a list of genderless names and nicknames.

In [57]:
cool_names = pd.read_csv("cool_names.csv")
cool_names.head()

       AALA
0  ABIMBOLA
1       ACE
2      ADAR
3       ADE
4      ADÉL

In [58]:
cool_names.tail()

       AALA
645  YUTAKA
646   YUVAL
647    ZAIN
648     ZAN
649  ZANDER

In [59]:
cool_names.shape

(650, 1)

In [60]:
cool_names.isna

<bound method DataFrame.isna of          AALA
0    ABIMBOLA
1         ACE
2        ADAR
3         ADE
4        ADÉL
..        ...
645    YUTAKA
646     YUVAL
647      ZAIN
648       ZAN
649    ZANDER

[650 rows x 1 columns]>

Okay, now I'm going to take three random names for each first name dataframes and pair them with random surnames from the surname database.

In [76]:
random_female = female_names["name"].sample(1)
random_female

809599    DANYELL
Name: name, dtype: object

In [82]:
random_male = male_names["name"].sample(1)
random_male

878488    KENNEY
Name: name, dtype: object

Now to download each of these dataframes into csv files to use them in main.py, which holds the user interface.

In [88]:
sorted_surnames.to_csv("sorted_surnames.csv", sep="\n", encoding="utf-8", index=False)

In [90]:
female_names.to_csv("female_names.csv", sep="\n", encoding="utf-8", index=False)

In [89]:
male_names.to_csv("male_names.csv", sep="\n", encoding="utf-8", index=False)

In [ ]:
random_cool_name = cool_names.sample(n=1)
random_cool_name

   AALA
4  ADÉL

In [79]:
random_surname = sorted_surnames["lastnames"].sample(n=1)
random_surname

15306    VOORHIES
Name: lastnames, dtype: object

And now for the name generation:

In [81]:
print("List of random names:")
print(f"Female: {random_female} + {random_surname}")
print(f"Female: {random_female} + {random_surname}")
print(f"Female: {random_female} + {random_surname}")
print(f"Male: {random_male} + {random_surname}")
print(f"Male: {random_male} + {random_surname}")
print(f"Male: {random_male} + {random_surname}")
print(f"Cool names: {random_cool_name} + {random_surname}")
print(f"Cool names: {random_cool_name} + {random_surname}")
print(f"Cool names: {random_cool_name} + {random_surname}")

List of random names:
Female: 809599    DANYELL
Name: name, dtype: object + 15306    VOORHIES
Name: lastnames, dtype: object
Female: 809599    DANYELL
Name: name, dtype: object + 15306    VOORHIES
Name: lastnames, dtype: object
Female: 809599    DANYELL
Name: name, dtype: object + 15306    VOORHIES
Name: lastnames, dtype: object
Male: 1509772    DONYE
Name: name, dtype: object + 15306    VOORHIES
Name: lastnames, dtype: object
Male: 1509772    DONYE
Name: name, dtype: object + 15306    VOORHIES
Name: lastnames, dtype: object
Male: 1509772    DONYE
Name: name, dtype: object + 15306    VOORHIES
Name: lastnames, dtype: object
Cool names:       AALA
446  OLLIE + 15306    VOORHIES
Name: lastnames, dtype: object
Cool names:       AALA
446  OLLIE + 15306    VOORHIES
Name: lastnames, dtype: object
Cool names:       AALA
446  OLLIE + 15306    VOORHIES
Name: lastnames, dtype: object

The main.py has the user interface to select three female, three male, and three cool(agendered and nicknames) names for use.